Revit 2027 API
DuctSettings.SetUp Property
 The abbreviation of the Set Up from top (TU) of fitting string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SetUp { get; set; }
Public Property SetUp As String
	Get
	Set
public:
property String^ SetUp {
	String^ get ();
	void set (String^ value);
}
member SetUp : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace